# ============================================================================
#  Brewfile — install with: brew bundle --file ~/projects/dotfiles/Brewfile
#  Strictly public packages. Work-only stuff lives in Brewfile.work.
# ============================================================================

# ---- Taps ----
tap "hashicorp/tap"
tap "anomalyco/tap"

# ---- CLI tools (modern shell stack) ----
brew "bat"                  # cat with syntax highlighting
brew "eza"                  # modern ls
brew "fd"                   # modern find
brew "fzf"                  # fuzzy finder
brew "git-delta"            # better git diffs
brew "gh"                   # github CLI
brew "lazygit"              # terminal UI for git
brew "ripgrep"              # fast grep (already had)
brew "watch"
brew "zoxide"               # smarter cd
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"        # zsh prompt theme

# ---- Languages / runtimes ----
brew "python@3.11"
brew "uv"                   # fast python package manager

# ---- Build tools ----
brew "gcc"
brew "tree-sitter"
brew "tree-sitter-cli"

# ---- Editor ----
brew "neovim"

# ---- Optional: niceties ----
brew "fastfetch"            # system info on shell startup

# ---- Cloudflare public CLI (no internal tap needed) ----
brew "cloudflared"

# ---- HashiCorp ----
brew "hashicorp/tap/terraform"

# ---- AI / agent tooling ----
brew "anomalyco/tap/opencode"
brew "agent-browser"

# ---- Casks ----
cask "ghostty"
cask "gcloud-cli"
cask "font-jetbrains-mono-nerd-font"
